# Importing Libraries

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [3]:
import warnings
warnings.filterwarnings(action='ignore')

# IMPORT DATASET

In [4]:
Ratings_df = pd.read_csv('C:\\book rental datasets\\book rental datasets\\BX-Book-Ratings.csv', encoding='latin-1')

In [5]:
Books_df = pd.read_csv('C:\\book rental datasets\\book rental datasets\\BX-Books.csv', encoding='latin-1')

In [6]:
Users_df = pd.read_csv('C:\\book rental datasets\\book rental datasets\\BX-Users.csv', encoding='latin-1')

In [7]:
Recommend_df = pd.read_csv('C:\\book rental datasets\\book rental datasets\\Recommend.csv', encoding='latin-1')

In [8]:
Users_df.head()

  user_id                            Location   Age
0       1                  nyc, new york, usa   NaN
1       2           stockton, california, usa  18.0
2       3     moscow, yukon territory, russia   NaN
3       4           porto, v.n.gaia, portugal  17.0
4       5  farnborough, hants, united kingdom   NaN

In [9]:
Users_df.shape

(278859, 3)

In [10]:
Books_df.head()

,isbn,book_title,book_author,year_of_publication,publisher
0,195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,2005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
2,60973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial
3,374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux
4,393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company

In [11]:
Books_df.shape

(271379, 5)

In [12]:
Ratings_df.head()

   user_id        isbn  rating
0   276725  034545104X       0
1   276726   155061224       5
2   276727   446520802       0
3   276729  052165615X       3
4   276729   521795028       6

In [13]:
Ratings_df.shape

(1048575, 3)

In [14]:
Recommend_df.head()

   196  242  3  881250949
0  186  302  3  891717742
1   22  377  1  878887116
2  244   51  2  880606923
3  166  346  1  886397596
4  298  474  4  884182806

In [15]:
Recommend_df.shape

(99999, 4)

# Read the books dataset and explore it

In [16]:
Books_df.head()

,isbn,book_title,book_author,year_of_publication,publisher
0,195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,2005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
2,60973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial
3,374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux
4,393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company

In [17]:
Books_df.shape

(271379, 5)

# Clean up NaN values

In [18]:
Books_df.isna().sum()

isbn                   0
book_title             0
book_author            1
year_of_publication    0
publisher              2
dtype: int64

In [19]:
Books_df.dropna(inplace=True)
Books_df.isna().any()

isbn                   False
book_title             False
book_author            False
year_of_publication    False
publisher              False
dtype: bool

# Read the data where ratings are given by users

In [20]:
Ratings_df.head()

   user_id        isbn  rating
0   276725  034545104X       0
1   276726   155061224       5
2   276727   446520802       0
3   276729  052165615X       3
4   276729   521795028       6

In [21]:
Ratings_df.shape

(1048575, 3)

# Take a quick look at the number of unique users and books

In [22]:
df_master = pd.merge(Books_df,Ratings_df, on='isbn')

In [23]:
df_master.head()

,isbn,book_title,book_author,year_of_publication,publisher,user_id,rating
0,195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,2,0
1,2005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,8,5
2,2005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,11400,0
3,2005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,11676,8
4,2005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,41385,0

In [25]:
df_master.isna().sum()

isbn                   0
book_title             0
book_author            0
year_of_publication    0
publisher              0
user_id                0
rating                 0
dtype: int64

In [26]:
print('Number of unique users: ', df_master['user_id'].nunique())
print('Number of books: ', df_master['isbn'].nunique())

Number of unique users:  83644
Number of books:  257829

# Convert ISBN variables to numeric numbers in the correct order

- Here we would take only a limited number of rows. Otherwise the out of memory problem occurs.

In [28]:
Ratings_new=pd.read_csv('C:\\book rental datasets\\book rental datasets\\BX-Book-Ratings.csv', encoding='latin-1', nrows=10000)

In [29]:
Ratings_new.shape

(10000, 3)

In [30]:
df_master1=pd.merge(Ratings_new,Books_df,on='isbn')

In [31]:
isbn_num=df_master1.isbn.unique()
def isbn_converter(value):
    itemindex=np.where(isbn_num==value)
    return itemindex[0][0]

In [32]:
len(isbn_num)

8051

In [33]:
df_master1['isbn_new']=df_master1['isbn'].apply(isbn_converter)
df_master1

,user_id,isbn,rating,book_title,book_author,year_of_publication,publisher,isbn_new
0,276725,034545104X,0,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books,0
1,276726,155061224,5,Rites of Passage,Judith Rae,2001,Heinle,1
2,276727,446520802,0,The Notebook,Nicholas Sparks,1996,Warner Books,2
3,278418,446520802,0,The Notebook,Nicholas Sparks,1996,Warner Books,2
4,276729,052165615X,3,Help!: Level 1,Philip Prowse,1999,Cambridge University Press,3
...,...,...,...,...,...,...,...,...
8696,243,385720106,7,A Map of the World,Jane Hamilton,1999,Anchor Books/Doubleday,8046
8697,243,425092917,0,The Accidental Tourist,Anne Tyler,1994,Berkley Publishing Group,8047
8698,243,425098834,0,If Morning Ever Comes,Anne Tyler,1983,Berkley Publishing Group,8048
8699,243,425163407,9,Unnatural Exposure,Patricia Daniels Cornwell,1998,Berkley Publishing Group,8049
8700,243,425164403,0,Only Love (Magical Love),Erich Segal,1998,Berkley Publishing Group,8050

# Convert the user_id variable to numeric numbers in the correct order

In [34]:
user_id_num=df_master1.user_id.unique()
def user_id_converter(user):
    itemindex=np.where(user_id_num==user)
    return itemindex[0][0]

In [35]:
len(user_id_num)

828

# Converting both user_id and ISBN to the ordered list, i.e., from 0...n-1

In [36]:
df_master1['user_id_new']=df_master1['user_id'].apply(user_id_converter)
df_master1.head()

,user_id,isbn,rating,book_title,book_author,year_of_publication,publisher,isbn_new,user_id_new
0,276725,034545104X,0,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books,0,0
1,276726,155061224,5,Rites of Passage,Judith Rae,2001,Heinle,1,1
2,276727,446520802,0,The Notebook,Nicholas Sparks,1996,Warner Books,2,2
3,278418,446520802,0,The Notebook,Nicholas Sparks,1996,Warner Books,2,3
4,276729,052165615X,3,Help!: Level 1,Philip Prowse,1999,Cambridge University Press,3,4

# Re-index the columns to build a matrix

In [37]:
column_order=['user_id_new', 'isbn_new', 'rating', 'book_title', 'book_author', 'year_of_publication', 'publisher', 'user_id','isbn']
df_master1=df_master1.reindex(columns=column_order)
df_master1.head()

,user_id_new,isbn_new,rating,book_title,book_author,year_of_publication,publisher,user_id,isbn
0,0,0,0,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books,276725,034545104X
1,1,1,5,Rites of Passage,Judith Rae,2001,Heinle,276726,155061224
2,2,2,0,The Notebook,Nicholas Sparks,1996,Warner Books,276727,446520802
3,3,2,0,The Notebook,Nicholas Sparks,1996,Warner Books,278418,446520802
4,4,3,3,Help!: Level 1,Philip Prowse,1999,Cambridge University Press,276729,052165615X

# Split your data into two sets (training and testing)

In [38]:
from sklearn.model_selection import train_test_split
train_data, test_data=train_test_split(df_master1, test_size=0.3)

In [39]:
n_users = df_master1['user_id'].nunique()
n_books = df_master1.isbn.nunique()

In [40]:
print(n_users)
print(n_books)

828
8051

- We create user-book matrix for training and testing sets.

In [41]:
 train_data_matrix = np.zeros((n_users, n_books))
for line in train_data.itertuples():
    train_data_matrix[line[1]-1, line[2]-1] = line[3]  
    

test_data_matrix = np.zeros((n_users, n_books))
for line in test_data.itertuples():
    test_data_matrix[line[1]-1, line[2]-1] = line[3]

In [42]:
from sklearn.metrics.pairwise import pairwise_distances
user_similar=pairwise_distances(train_data_matrix, metric='cosine')
item_similar=pairwise_distances(train_data_matrix.T, metric='cosine')

In [43]:
user_similar

array([[0., 1., 1., ..., 1., 1., 1.],
       [1., 0., 1., ..., 1., 1., 1.],
       [1., 1., 0., ..., 1., 1., 1.],
       ...,
       [1., 1., 1., ..., 0., 1., 1.],
       [1., 1., 1., ..., 1., 0., 1.],
       [1., 1., 1., ..., 1., 1., 0.]])

In [44]:
item_similar

array([[0., 1., 1., ..., 1., 1., 1.],
       [1., 0., 1., ..., 1., 1., 1.],
       [1., 1., 0., ..., 1., 1., 1.],
       ...,
       [1., 1., 1., ..., 0., 1., 1.],
       [1., 1., 1., ..., 1., 0., 1.],
       [1., 1., 1., ..., 1., 1., 0.]])

# Make predictions based on user and item variables

In [47]:
def predict(Ratings_df, similarity, type='user'):
    if type == 'user':
        mean_user_rating = Ratings_df.mean(axis=1)
        ratings_diff = (Ratings_df - mean_user_rating[:, np.newaxis]) 
        pred = mean_user_rating[:, np.newaxis] + similarity.dot(ratings_diff) / np.array([np.abs(similarity).sum(axis=1)]).T
    elif type == 'item':
        pred = Ratings_df.dot(similarity) / np.array([np.abs(similarity).sum(axis=1)])     
    return pred

In [48]:
item_prediction = predict(train_data_matrix, item_similar, type='item')
user_prediction = predict(train_data_matrix, user_similar, type='user')

# Use RMSE to evaluate the predictions

In [49]:
from sklearn.metrics import mean_squared_error
from math import sqrt

def rmse(prediction, ground_truth):
    prediction = prediction[ground_truth.nonzero()].flatten() 
    ground_truth = ground_truth[ground_truth.nonzero()].flatten()
    return sqrt(mean_squared_error(prediction, ground_truth))

In [50]:
print('User-based CF RMSE: ' + str(rmse(user_prediction, test_data_matrix)))
print('Item-based CF RMSE: ' + str(rmse(item_prediction, test_data_matrix)))

User-based CF RMSE: 7.757506130413076
Item-based CF RMSE: 7.757069611917873

# Conclusion - Both the approach yield almost same result.